
items = [ // [row_number, description, quantity, unitPrice, amount]
[1,"茶裏王台灣綠茶",2,20,40],[2,"茶裏王英式紅茶",20,20,400]
];
items2 = [
[1,"茶裏王台灣綠茶",2,20,40],[2,"茶裏王英式紅茶",20,20,400],[3,"茶裏王烏龍綠茶",1,20,20],[4,"茶裏王青心烏龍",35,20,700]
];
items3 = [
[1,"A4影印",23,2,46],[2,"麥香紅茶",1,10,10],[3,"麥香奶茶",12,10,120]
];
invocie = [
["20150204","AV1234567890",100,items],
["20150205","AV1234567891",1000,items2],
["20150206","AV1234567892",2100,items3]
];
test_data = [
[121.522932,25.041973,"男四","台北市中正區紹興南街6號",233,invocie,1],
[121.521613,25.040995,"男二","台北市中正區徐州路2-3號",131,invocie,1],
[121.518941,25.040797,"臺大醫院","台北市中正區中山南路7號",34,invocie,1],
[121.523083,25.041254,"公衛學院","台北市中正區徐州路3號",33,invocie,1],
[121.525110,25.040836,"舊社科院","台北市中正區徐州路21號",72,invocie,1],
[121.541536,25.019615,"德田館","台北市大安區羅斯福路四段1號",108,invocie,2],
[121.544079,25.017771,"明達館","台北市大安區羅斯福路四段1號",21,invocie,2],
[121.540925,25.017421,"總圖","台北市大安區羅斯福路四段1號",56,invocie,2],
[121.543522,25.026107,"捷運科技大樓站","台北市大安區復興南路二段235號",1,invocie,3],
[121.543599,25.024967,"勝立百貨","台北市大安區復興南路二段291號",2,invocie,3]
];
my_data = [[897, '121.518491', '25.029665', '全家便利商店', '金昌分公司', '臺北市中正區南福里南昌路１段１３５號１樓', 1, 25.0, '鮪魚飯糰', 0, []], [3876, '121.5226', '25.042659', '統一超商', '中航', '台北市中正區林森南路12號', 21, 793.0, '1/21統一指定品牌-飲冰室茶?*726', 0, []], [3877, '121.5229', '25.043782', '統一超商', '千成', '台北市中正區林森南路4號之3', 3, 101.0, '鮪魚飯糰', 0, []], [3878, '121.5221', '25.040189', '統一超商', '台大', '台北市中正區林森南路53號55號', 3, 164.0, '佛蒙特咖哩飯', 0, []], [1031, '121.526836', '25.041557', '全家便利商店', '齊東分公司', '臺北市中正區濟南路２段３之７號１樓', 8, 243.0, '大口法香烤雞飯糰', 0, []], [1288, '121.532986', '25.034493', '安心食品服務', '新生南路分公司', '臺北市大安區新生南路１段１６１之１及１６１之２號', 1, 39.0, '鮮食促', 0, []], [905, '121.522074', '25.039902', '全家便利商店', '林森南路分公司', '臺北市中正區林森南路５７號１樓', 6, 236.0, '飲冰室茶集綠奶茶', 0, []], [3886, '121.5253', '25.03518', '統一超商', '杭信', '台北市中正區信義路二段15號1樓', 1, 39.0, '鮪魚飯糰', 0, []], [783, '121.520702', '25.048494', '全家便利商店', '市民分公司', '臺北市中山區民安里中山北路１段５８號１樓', 1, 23.0, '肉鬆飯糰（三配）', 0, []], [4308, '121.51857', '25.04879', '萊爾富便利商店', '北市京站店', '台北市大同區市民大道一段209號', 1, 38.0, '我們的克林姆麵包', 0, []], [3640, '121.5181', '25.050758', '統一超商', '長峰', '台北市大同區長安西路45號之1', 1, 22.0, '御茶園特上奶茶PET550', 0, []], [990, '121.532955', '25.034315', '全家便利商店', '新生南路分公司', '臺北市大安區新生南路一段１６３號１樓', 1, 39.0, '鮮食促', 0, []], [3722, '121.5449', '25.017414', '統一超商', '長星', '台北市大安區基隆路三段85號', 1, 35.0, '握便當-奮起湖雞腿', 1, []], [779, '121.537446', '25.017979', '全家便利商店', '台福分公司', '臺北市大安區學府里羅斯福路４段１號', 4, 121.0, '低溫促', 1, []], [988, '121.540274', '25.017764', '全家便利商店', '新台大門市部', '臺北市大安區學府里羅斯福路４段１號（學生第一活動中心１樓）', 3, 97.0, '小計折扣-10%', 1, []], [3679, '121.541', '25.022097', '統一超商', '敦親', '台北市大安區辛亥路二段171巷8號', 1, 39.0, 'Sunkist芭樂柳橙綜合果汁飲料', 1, []], [3771, '121.5359', '25.058116', '統一超商', '佳佳', '台北市中山區民生東路二段157號', 1, 25.0, '極緻經典-克林姆麵包', 2, []]];
my_data_old = [
[3680, '121.541', '25.022097', '統一超商', '敦親', '台北市大安區辛亥路二段171巷8號', 1, 39.0, '39元超值組合20150527~0609*8605', 0, [['VS09635683', '敦親', 39, [[1, 'Sunkist芭樂柳橙綜合果汁飲料', '1', '25', 25], [2, '鮪魚飯糰', '1', '25', 25], [3, '39元超值組合20150527~0609*8605', '1', '-11', -11]]]]],
[1032, '121.526836', '25.041557', '全家便利商店', '齊東分公司', '臺北市中正區濟南路２段３之７號１樓', 1, 40.0, '草莓麵包', 0, [['VW56130612', '齊東分公司', 40, [[1, '草莓麵包', '1', '18', 18], [2, '綠茶拿鐵', '1', '25', 25], [3, '低溫促', '1', '0', -3]]]]],
[3877, '121.5226', '25.042659', '統一超商', '中航', '台北市中正區林森南路12號', 1, 39.0, 'Sunkist芭樂柳橙綜合果汁飲料', 0, [['VT09822392', '中航', 39, [[1, '鮪魚飯糰', '1', '25', 25], [2, 'Sunkist芭樂柳橙綜合果汁飲料', '1', '25', 25], [3, '39元超值組合20150527~0609*8605', '1', '-11', -11]]]]],
[3878, '121.5229', '25.043782', '統一超商', '千成', '台北市中正區林森南路4號之3', 1, 39.0, '39元超值組合20150527~0609*8605', 0, [['VR53664190', '千成', 39, [[1, '飲冰室茶集烏龍奶茶400ml(盒)', '1', '25', 25], [2, '鮪魚飯糰', '1', '25', 25], [3, '39元超值組合20150527~0609*8605', '1', '-11', -11]]]]]
];